{
    "textsPage": {
        "textIdiom": "Idiomas",
        "textTheme": "Tema",
        "textCountry": "Argentina",
        "textPagesraliced": "10 Páginas realizadas",
        "textButtonProject": "Ver Proyectos",
        "textButtonCv": "Descargar CV",
        "textButtonContact": "Contáctame",
        "textExperience": "Experiencia",
        "textExp1": "Independiente",
        "textExp2": "No Country",
        "textExp3": "Proyectos",
        "textAbout": "Acerca de",
        "textMoreProjects": "Más Proyectos",
        "textAboutme": "Con tres años de formación, que incluyen un año de experiencia práctica, me he especializado en UX/UI utilizando Atomic Design. He participado en simulaciones laborales, colaborando en equipos de hasta seis personas. Además, he desarrollado proyectos por encargo. Sumado a mis conocimientos en back-end, estoy preparado para integrarme a un equipo profesional.",
        "textMyLikendin": "Mi Linkedin",
        "textMyGithub": "Mi Github",
        "textRepo": "Repositorio de Mi Portfolio",
        "textCopied": "¡Correo copiado!",
        "textActualProject": "Proyectos actuales",
        "textbuttonviewMore":"Ver Mas",
        "textSwipe":"Desliza para ver más"
    },
    "actualProjects": [
        
        {
            "title": "LyvMaz",
            "description": "Trabajando en un proyecto freelance para artista colombiana con otro desarrollador. Integrando testing con Vitest con el fin de mejorar la calidad del producto final.",
            "href": "https://www.linkedin.com/feed/update/urn:li:activity:7341233747272294400/"
        },
        {
            "title": "ATSforShareIt",
            "description": "Este proyecto al que me uní recientemente, liderado por la comunidad Share It, busca ayudar a programadores a crear un CV optimizado para superar filtros ATS y acceder a nuevas oportunidades laborales.",
            "href": "https://www.linkedin.com/feed/update/urn:li:activity:7335781188676075520/"
        },
        {
            "title": "No-Name",
            "description": "Producto que integra e-commerce y control de inventario con foco en reutilizacion y personalizacion para adaptar el servicio a la identidad de marca de nuestros clientes.",
            "href": "https://www.linkedin.com/feed/update/urn:li:activity:7335781188676075520/"
        }
    ],
    "projectTexts": {
        "inAudio": {
            "title": "In-Audio",
            "description": [
                "Es un proyecto que se encuentra en su primera etapa de cuatro planificadas.",
                " Su funcionalidad actual es otorgar música ininterrumpida, obteniendo canciones desde la API de Jamendo mediante un backend propio.",
                " Este backend se encarga tanto de la recepción y distribución de la información al front-end, como del resguardo seguro de la API key."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Motion" },
                { "name": "Node.js" },
                { "name": "Express" }
            ],
            "image": [
                "/in-1.png",
                "/in2.png",
                "/in3.png",
                "/in4.png"
            ],
            "link": {
                "type": "deploy",
                "url": "https://in-audio.netlify.app/"
            }
        },
        "Urbania": {
            "title": "Urbania",
            "description": [
                "es un proyecto desarrollado durante mi última simulación laboral en No-Country.",
                " Me desempeñé como desarrollador Front-End y también como líder de equipo, coordinando tareas, promoviendo una componentización eficiente y mejorando el rendimiento general de la aplicación.",
                " Colaboré con el diseñador UX/UI proponiendo ajustes visuales que elevaron la experiencia del usuario.",
                " Además, implementé animaciones con Framer Motion, logrando una interfaz más atractiva y fluida."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Motion" },
                { "name": "Node.js" },
                { "name": "Express" }
            ],
            "image": [
                "/ur1.png",
                "/ur2.png",
                "/ur3.png",
                "/ur4.png",
                "/ur5.png",
                "/ur6.png",
                "/ut7.png",
                "/ur8.png",
                "/ur9.png",
                "/ur10.png",
                "/ur11.png"
            ],
            "link": {
                "type": "deploy",
                "url": "https://s21-14-n-webapp-urbania.onrender.com/"
            }
        },
        "WordRank": {
            "title": "WordRank",
            "description": [
                ", aplicación que desarrollé tras finalizar mi primera simulación laboral en No-Country.",
                " Sentí la necesidad de afianzar mis conocimientos en el consumo de APIs, por lo que encaré este proyecto como desafío personal.",
                " La plataforma permite buscar, filtrar y ordenar países a través de una API pública, mostrando un contador dinámico de resultados y vistas detalladas por país, incluyendo navegación entre países vecinos.",
                " Implementé lazy loading para optimizar el rendimiento y afinar mis habilidades en renderizado eficiente."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Motion" },
                { "name": "Axios" }
            ],
            "image": [
                "/wr1.png",
                "/wr2.png"
            ],
            "link": {
                "type": "repo",
                "url": "https://github.com/AzzADesigns/WordRanks"
            }
        },
        "HuellitasEnCasa": {
            "title": "Huellitas En Casa",
            "description": [
                "se realizó durante mi primer proyecto de simulación laboral en No-Country, donde actué como diseñador UX/UI y responsable del Front-End.",
                " Me encargué del diseño completo y la maquetación de la plataforma, enfocándome en ofrecer una experiencia de usuario fluida.",
                " La aplicación permitía el registro e inicio de sesión tanto para usuarios como para refugios; estos últimos podían cargar y editar información de mascotas.",
                " Fue mi primer contacto práctico con el trabajo con APIs, marcando el inicio de mi transición del diseño al desarrollo."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Java" }
            ],
            "image": [
                "/hu1.png",
                "/hu2.png",
                "/hu3.png",
                "/hu4.png",
                "/hu5.png",
                "/hu6.png",
                "/hu7.png",
                "/hu8.png",
                "/hu9.png"
            ],
            "link": {
                "type": "repo",
                "url": "https://github.com/No-Country-simulation/c21-38-n-java-react"
            }
        },
        "ClassRun": {
            "title": "ClassRun",
            "description": [
                ", este proyecto fue realizado durante mi segunda simulación laboral en No-Country, donde me desempeñé como desarrollador Front-End.",
                " Uno de los desafíos principales fue adaptarme a tecnologías que no había utilizado antes, como Next.js, Shadcn y TypeScript, impuestas por decisiones de arquitectura del equipo.",
                " Durante las cinco semanas que duró la simulación, me enfoqué en integrarme rápidamente, aportando soluciones efectivas incluso ante la deserción de varios compañeros.",
                " Finalicé la experiencia con un Front-End funcional que implementaba manejo de estado global mediante Context API.",
                " La aplicación está orientada a la gestión académica, permitiendo a docentes y tutores realizar seguimientos personalizados de materias y alumnos."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Netxjs" },
                { "name": "ShadCn" },
                { "name": "Typescript" },
                { "name": "Nodejs" },
                { "name": "Express" }
            ],
            "image": [
                "/cl1.png",
                "/cl2.png",
                "/cl3.png",
                "/cl4.png",
                "/cl5.png",
                "/cl6.png",
                "/cl7.png",
                "/cl8.png"
            ],
            "link": {
                "type": "repo",
                "url": "https://github.com/No-Country-simulation/s20-03-webapp"
            }
        },
        "CodigoDelMar": {
            "title": "Codigo Del Mar",
            "description": [
                ", es un trabajo por encargo profesional para crear una landing page orientada a mejorar la presencia online del equipo 'Programadores de Mar del Plata'.",
                " El diseño se enfocó en transmitir identidad visual de marca con una estética simple pero atractiva, presentando sus servicios y experiencia de forma clara.",
                " Incluye un formulario de contacto validado, facilitando la comunicación directa con potenciales clientes.",
                " Actualmente el proyecto se encuentra en pausa hasta que los clientes definan nuevos contenidos para su despliegue oficial."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Motion" }
            ],
            "image": [
                "/cm1.png",
                "/cm2.png",
                "/cm3.png",
                "/cm4.png",
                "/cm5.png",
                "/cm6.png"
            ],
            "link": {
                "type": "deploy",
                "url": "https://cdelmar.netlify.app/"
            }
        },
        "Acme": {
            "title": "Acme",
            "description": [
                ", sitio web que realicé siguiendo la documentación oficial de Next.js, donde aprendí a",
                "manejar el enrutamiento nativo de la tecnología, aplicar autenticación y trabajar con",
                " renderizado del lado del servidor (SSR). Contiene un CRUD de facturas y visualización",
                " de datos en tiempo real provenientes de una base de datos PostgreSQL."
            ],
            "technologies": [
                { "name": "React" },
                { "name": "Tailwind" },
                { "name": "Nextjs" }
            ],
            "image": [
                "/acme1.png",
                "/acme2.png",
                "/acme3.png",
                "/acme4.png"
            ],
            "link": {
                "type": "repo",
                "url": "https://github.com/AzzADesigns/Acme"
            }
        }
    }
}